app/views/students/show.html.erb

            <ul>
              <li class="col-lg-3 col-md-4 col-sm-6 col-xs-12"><% @wdier.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" INNER JOIN "negatives" ON "photos"."id" = "negatives"."photo_id" WHERE "negatives"."student_id" = $1  [["student_id", 6]]

<button> <%= link_to "Add new comment", new_student_comment_path(@student) %></button>
<% @student.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."student_id" = $1  [["student_id", 6]]