app/views/instructors/show.html.erb

            <ul>
              <li class="col-lg-3 col-md-4 col-sm-6 col-xs-12"><% @wdier.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" INNER JOIN "negatives" ON "photos"."id" = "negatives"."photo_id" WHERE "negatives"."instructor_id" = $1  [["instructor_id", 23]]

  <%= link_to "Add new comment", new_instructor_comment_path(@instructor) %>
  <% @instructor.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."instructor_id" = $1  [["instructor_id", 7]]