app/controllers/codeys_controller.rb

  def index
    @codeys = Codey.all
---
SELECT "codeys".* FROM "codeys"