app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @student = Student.find(params[:student_id])
    @comment = Comment.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @student = Student.find(params[:student_id])

INSERT INTO "comments" DEFAULT VALUES RETURNING "id"
---
  def create
    @comment = Commment.create!(comment_params.merge(user: current_user))