app/controllers/instructors_controller.rb

  def index
    @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

  def create
    @instructor = Instructor.create!(instructor_params)
---
INSERT INTO "instructors" ("name", "img_url", "squad_name", "squad_id", "codey_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jesse Shawl"], ["img_url", "https://pbs.twimg.com/profile_images/494612822740197377/4ldXwgN5_400x400.jpeg"], ["squad_name", "Jesse and the Rippers"], ["squad_id", 3], ["codey_id", 43]]

  def show
    @instructor = Instructor.find(params[:id])
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @instructor = Instructor.find(params[:id])
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 2]]

  def update
    @instructor = Instructor.find(params[:id])
    @instructor.update(instructor_params)
---
SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "instructors" SET "img_url" = $1, "squad_name" = $2 WHERE "instructors"."id" = $3  [["img_url", "https://pbs.twimg.com/profile_images/566317879713214465/jzp0Z10y.jpeg"], ["squad_name", "Becky's Beauties"], ["id", 3]]