app/controllers/instructors_controller.rb

  def show
    @wdier = Wdier.find(params[:id])
    # @instructor = Wdier.instructor.find(params[:id])
    @instructor = Wdier.where(role: "Instructor")
    @student = Wdier.student.where(squad_id: @instructor.squad_id)
---
SELECT "students".* FROM "students" WHERE "students"."squad_id" = $1  [["squad_id", 21]]