app/controllers/squads_controller.rb

SELECT "squads".* FROM "squads"
---
  def index
    @squads = Squad.all