app/controllers/students_controller.rb

  def create
    @student = Student.create!(student_params)
---
INSERT INTO "students" ("name", "img_url", "github_url", "portfolio_url", "project1_url", "project2_url", "project3_url", "project4_url", "quote", "q1", "q2", "q4", "fb", "linkedin", "email") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"