app/controllers/yearbook_controller.rb

SELECT "yearbooks".* FROM "yearbooks"
---
  def index
    @yearbook = Yearbook.all